if-else-master/AI-VoiceTransMic/esp32_voice_mic/esp32_voice_mic.ino
/*
 * ESP32 AI語音翻譯麥克風系統 (簡化版)
 * 
 * 硬件配置:
 * - ESP32-WROOM-32
 * - INMP441 MEMS 麥克風
 * - 喇叭 (8Ω 0.5W)
 * 
 * 功能:
 * - 即時音頻捕獲
 * - 藍牙音頻傳輸
 * - 語音播放
 * 
 * 作者: Your Name
 * 版本: 1.3 (修復錄音判斷邏輯)
 * 日期: 2024
 * 
 * 修復說明:
 * - 兼容不同版本的ESP32 Arduino Core
 * - 修復LEDC函數API變更問題
 * - 修復錄音時間過短的判斷邏輯BUG
 * - 改善音頻樣本收集機制
 * - 降低錄音有效性判斷門檻
 */

#include <Arduino.h>
#include "BLEDevice.h"
#include "BLEServer.h"
#include "BLEUtils.h"
#include "BLE2902.h"
#include <driver/i2s.h>
#include <driver/dac.h>
#include <LiquidCrystal_I2C.h>  // ESP32 compatible version
#include <Wire.h>

// === 硬件配置 ===
// INMP441 麥克風引腳配置
#define I2S_WS 25     // LRCK (Left/Right Clock)
#define I2S_SD 33     // DOUT (Serial Data Out)  
#define I2S_SCK 32    // BCLK (Bit Clock)

// 喇叭 DAC 輸出
#define SPEAKER_PIN 26  // DAC 輸出引腳

// 控制按鈕
#define RECORD_BUTTON 2   // 錄音按鈕
#define MODE_BUTTON 4     // 模式切換按鈕

// LED 指示燈
#define LED_RECORDING 5   // 錄音指示燈
#define LED_PROCESSING 18 // 處理指示燈
#define LED_SPEAKING 19   // 播放指示燈

// LCD 顯示器配置
#define LCD_ADDRESS 0x27  // I2C地址
#define LCD_COLS 16       // 列數
#define LCD_ROWS 2        // 行數
#define LCD_SDA 21        // SDA引腳
#define LCD_SCL 22        // SCL引腳

// BLE配置
#define SERVICE_UUID        "12345678-1234-1234-1234-123456789abc"
#define AUDIO_CHAR_UUID     "87654321-4321-4321-4321-cba987654321"  
#define COMMAND_CHAR_UUID   "11111111-2222-3333-4444-555555555555"

// === 音頻參數 ===
#define SAMPLE_RATE 16000      // 採樣率 16kHz
#define BITS_PER_SAMPLE 16     // 16位音頻
#define CHANNELS 1             // 單聲道
#define BUFFER_SIZE 1024       // 緩衝區大小
#define MAX_AUDIO_DURATION 15  // 最大錄音時長（秒）
#define FIXED_RECORDING_DURATION 15  // 強制錄音時長（秒）
#define REALTIME_CHUNK_DURATION 3  // 即時處理的音頻片段長度（秒）

// === 全局變量 ===
BLEServer* pServer = nullptr;
BLECharacteristic* pAudioCharacteristic = nullptr;
BLECharacteristic* pCommandCharacteristic = nullptr;
LiquidCrystal_I2C lcd(LCD_ADDRESS, LCD_COLS, LCD_ROWS);

// 音頻緩衝區
int16_t audioBuffer[BUFFER_SIZE];
int16_t* recordingBuffer;
size_t bufferIndex = 0;
size_t maxBufferSize;

// 系統狀態
enum SystemState {
  IDLE,           // 空閒狀態
  RECORDING,      // 錄音中
  PROCESSING,     // 處理中
  PLAYING,        // 播放中
  BLUETOOTH_DISCONNECTED
};

SystemState currentState = BLUETOOTH_DISCONNECTED;
bool bluetoothConnected = false;
bool recordingActive = false;
unsigned long lastActivityTime = 0;
unsigned long recordingStartTime = 0;

// BLE連接狀態
bool deviceConnected = false;
bool oldDeviceConnected = false;

// 語音活動檢測
const int16_t SILENCE_THRESHOLD = 500;
const unsigned long SILENCE_DURATION = 1000;  // 1秒靜音
const unsigned long MIN_RECORDING_DURATION = 300; // 最短錄音300ms
unsigned long lastSpeechTime = 0;
bool speechDetected = false;

// 錄音模式控制
bool manualRecording = false;  // true: 按鈕觸發的手動錄音, false: 自動語音檢測錄音

// 函數聲明
void handleBLECommand(char command);
void startRecording(bool manual);
void playTestTone(int frequency, int duration_ms);
void playReceivedAudio(uint8_t* audioData, size_t audioSize);

// BLE服務器回調類
class MyServerCallbacks: public BLEServerCallbacks {
    void onConnect(BLEServer* pServer) {
      deviceConnected = true;
      Serial.println("📱 BLE設備已連接");
    };

    void onDisconnect(BLEServer* pServer) {
      deviceConnected = false;
      Serial.println("📱 BLE設備已斷開");
    }
};

// BLE特徵回調類
class MyCallbacks: public BLECharacteristicCallbacks {
    void onWrite(BLECharacteristic *pCharacteristic) {
      String rxValue = pCharacteristic->getValue().c_str();

      if (rxValue.length() > 0) {
        char command = rxValue[0];
        handleBLECommand(command);
      }
    }
};

void setup() {
  Serial.begin(115200);
  Serial.println("🎤 ESP32 AI語音翻譯麥克風系統啟動中...");
  
  // 顯示初始內存狀態
  printMemoryInfo("系統啟動");
  
  // 初始化硬件
  initGPIO();
  printMemoryInfo("GPIO初始化後");
  
  initI2S();
  printMemoryInfo("I2S初始化後");
  
  initBLE();
  printMemoryInfo("BLE初始化後");
  
  initAudioBuffer();
  printMemoryInfo("音頻緩衝區初始化後");
  
  initLCD();
  printMemoryInfo("LCD初始化後");
  
  Serial.println("✅ 系統初始化完成！");
  Serial.println("📱 等待BLE連接...");
  currentState = BLUETOOTH_DISCONNECTED;
}

void loop() {
  // 檢查藍牙連接狀態
  checkBluetoothConnection();
  
  // 檢查按鈕輸入
  checkButtons();
  
  // 根據當前狀態執行相應操作
  switch (currentState) {
    case IDLE:
      handleIdleState();
      break;
      
    case RECORDING:
      handleRecordingState();
      break;
      
    case PROCESSING:
      handleProcessingState();
      break;
      
    case PLAYING:
      handlePlayingState();
      break;
      
    case BLUETOOTH_DISCONNECTED:
      handleDisconnectedState();
      break;
  }
  
  // 處理藍牙數據接收
  handleBluetoothData();
  
  delay(10); // 小延遲避免CPU過載
}

// === 初始化函數 ===

void initGPIO() {
  // 配置按鈕輸入
  pinMode(RECORD_BUTTON, INPUT_PULLUP);
  pinMode(MODE_BUTTON, INPUT_PULLUP);
  
  // 配置LED輸出
  pinMode(LED_RECORDING, OUTPUT);
  pinMode(LED_PROCESSING, OUTPUT);
  pinMode(LED_SPEAKING, OUTPUT);
  
  // 初始化LED狀態
  digitalWrite(LED_RECORDING, LOW);
  digitalWrite(LED_PROCESSING, LOW);
  digitalWrite(LED_SPEAKING, LOW);
  
  Serial.println("✅ GPIO 初始化完成");
}

void initI2S() {
  // I2S 配置 (麥克風輸入)
  i2s_config_t i2s_config = {
    .mode = (i2s_mode_t)(I2S_MODE_MASTER | I2S_MODE_RX),
    .sample_rate = SAMPLE_RATE,
    .bits_per_sample = I2S_BITS_PER_SAMPLE_16BIT,
    .channel_format = I2S_CHANNEL_FMT_ONLY_LEFT,
    .communication_format = I2S_COMM_FORMAT_STAND_I2S,
    .intr_alloc_flags = ESP_INTR_FLAG_LEVEL1,
    .dma_buf_count = 4,
    .dma_buf_len = BUFFER_SIZE,
    .use_apll = false,
    .tx_desc_auto_clear = false,
    .fixed_mclk = 0
  };
  
  // I2S 引腳配置
  i2s_pin_config_t pin_config = {
    .bck_io_num = I2S_SCK,
    .ws_io_num = I2S_WS,
    .data_out_num = I2S_PIN_NO_CHANGE,
    .data_in_num = I2S_SD
  };
  
  // 安裝 I2S 驅動
  esp_err_t result = i2s_driver_install(I2S_NUM_0, &i2s_config, 0, NULL);
  if (result != ESP_OK) {
    Serial.printf("❌ I2S 驅動安裝失敗: %d\n", result);
    return;
  }
  
  result = i2s_set_pin(I2S_NUM_0, &pin_config);
  if (result != ESP_OK) {
    Serial.printf("❌ I2S 引腳配置失敗: %d\n", result);
    return;
  }
  
  Serial.println("✅ I2S (麥克風) 初始化完成");
}

void initBLE() {
  // 初始化BLE設備
  BLEDevice::init("ESP32-VoiceMic");
  
  // 創建BLE服務器
  pServer = BLEDevice::createServer();
  pServer->setCallbacks(new MyServerCallbacks());
  
