if-else-master/AI-VoiceTransMic/esp32_voice_mic/esp32_voice_mic.ino
  // 創建BLE服務
  BLEService *pService = pServer->createService(SERVICE_UUID);
  
  // 創建音頻特徵 (用於發送音頻數據)
  pAudioCharacteristic = pService->createCharacteristic(
                      AUDIO_CHAR_UUID,
                      BLECharacteristic::PROPERTY_READ |
                      BLECharacteristic::PROPERTY_WRITE |
                      BLECharacteristic::PROPERTY_NOTIFY
                    );
  pAudioCharacteristic->addDescriptor(new BLE2902());
  
  // 創建命令特徵 (用於接收控制命令)
  pCommandCharacteristic = pService->createCharacteristic(
                         COMMAND_CHAR_UUID,
                         BLECharacteristic::PROPERTY_READ |
                         BLECharacteristic::PROPERTY_WRITE
                       );
  pCommandCharacteristic->setCallbacks(new MyCallbacks());
  
  // 啟動服務
  pService->start();
  
  // 開始廣播
  BLEAdvertising *pAdvertising = BLEDevice::getAdvertising();
  pAdvertising->addServiceUUID(SERVICE_UUID);
  pAdvertising->setScanResponse(false);
  pAdvertising->setMinPreferred(0x0);
  BLEDevice::startAdvertising();
  
  Serial.println("✅ BLE初始化完成");
  Serial.println("📱 設備名稱: ESP32-VoiceMic");
  Serial.println("📡 等待BLE連接...");
}

void initAudioBuffer() {
  maxBufferSize = SAMPLE_RATE * MAX_AUDIO_DURATION;
  size_t requiredMemory = maxBufferSize * sizeof(int16_t);
  
  Serial.printf("🔍 嘗試分配音頻緩衝區: %d 樣本, %d 字節\n", maxBufferSize, requiredMemory);
  Serial.printf("📊 系統可用內存: %d 字節\n", ESP.getFreeHeap());
  
  // 檢查可用內存是否足夠
  if (ESP.getFreeHeap() < requiredMemory + 50000) { // 保留50KB安全邊界
    Serial.println("⚠️ 內存不足，減少緩衝區大小");
    
    // 計算可用的最大緩衝區大小
    size_t availableMemory = ESP.getFreeHeap() - 50000; // 保留安全邊界
    maxBufferSize = availableMemory / sizeof(int16_t);
    
    // 確保不超過10秒（作為後備）
    size_t maxSafeSize = SAMPLE_RATE * 10;
    if (maxBufferSize > maxSafeSize) {
      maxBufferSize = maxSafeSize;
    }
    
    Serial.printf("🔧 調整後緩衝區大小: %d 樣本 (%.1f秒)\n", 
                  maxBufferSize, (float)maxBufferSize / SAMPLE_RATE);
  }
  
  recordingBuffer = (int16_t*)malloc(maxBufferSize * sizeof(int16_t));
  
  if (recordingBuffer == NULL) {
    Serial.println("❌ 音頻緩衝區分配失敗");
    Serial.printf("❌ 嘗試分配: %d 字節, 可用內存: %d 字節\n", 
                  maxBufferSize * sizeof(int16_t), ESP.getFreeHeap());
    
    // 嘗試更小的緩衝區
    maxBufferSize = SAMPLE_RATE * 5; // 5秒作為最小緩衝區
    recordingBuffer = (int16_t*)malloc(maxBufferSize * sizeof(int16_t));
    
    if (recordingBuffer == NULL) {
      Serial.println("❌ 最小緩衝區分配也失敗，系統無法運行");
      return;
    } else {
      Serial.printf("✅ 使用最小緩衝區: %d 樣本 (5秒)\n", maxBufferSize);
    }
  } else {
    Serial.printf("✅ 音頻緩衝區分配成功: %d 樣本 (%.1f秒)\n", 
                  maxBufferSize, (float)maxBufferSize / SAMPLE_RATE);
    Serial.printf("📊 分配後剩餘內存: %d 字節\n", ESP.getFreeHeap());
  }
}

void initLCD() {
  // 初始化I2C
  Wire.begin(LCD_SDA, LCD_SCL);
  
  // 初始化LCD
  lcd.init();
  lcd.backlight();
  
  // 顯示啟動信息
  lcd.clear();
  lcd.setCursor(0, 0);
  lcd.print("ESP32-VoiceMic");
  lcd.setCursor(0, 1);
  lcd.print("Starting...");
  
  Serial.println("✅ LCD 初始化完成");
}

// === 狀態處理函數 ===

void handleIdleState() {
  // 持續的自動語音檢測 - 實現即時處理
  static unsigned long lastVoiceCheck = 0;
  
  if (millis() - lastVoiceCheck > 100) { // 每100ms檢查一次
    if (checkVoiceActivity()) {
      startRecording(false); // 自動模式
    }
    lastVoiceCheck = millis();
  }
  
  // 更新空閒顯示（減少頻率避免干擾）
  static unsigned long lastUpdate = 0;
  if (millis() - lastUpdate > 5000) { // 5秒更新一次
    Serial.println("📱 系統就緒，持續監聽中... - " + getCurrentTime());
    updateLCDDisplay("Listening", "Ready");
    lastUpdate = millis();
  }
}

void handleRecordingState() {
  unsigned long currentTime = millis();
  unsigned long elapsedTime = currentTime - recordingStartTime;
  
  // 計算實際可錄音的最大時長
  float maxRecordingTime = (float)maxBufferSize / SAMPLE_RATE;
  
  if (manualRecording) {
    // 按鈕觸發的手動錄音模式：使用實際可用的錄音時長
    float targetDuration = min((float)FIXED_RECORDING_DURATION, maxRecordingTime);
    
    if (elapsedTime >= targetDuration * 1000) {
      Serial.printf("⏰ 完成%.1f秒錄音，停止錄音\n", targetDuration);
      stopRecording();
      return;
    }
    
    // 繼續錄音並檢測語音活動（但不根據靜音停止）
    checkVoiceActivity();
    
    // 更新錄音顯示
    static unsigned long lastBlink = 0;
    if (currentTime - lastBlink > 500) {
      digitalWrite(LED_RECORDING, !digitalRead(LED_RECORDING));
      
      int duration = elapsedTime / 1000;
      int remaining = (int)targetDuration - duration;
      Serial.printf("🎤 手動錄音中... 已錄: %ds, 剩餘: %ds (最大%.1fs)\n", 
                    duration, remaining, maxRecordingTime);
      updateLCDDisplay("Manual Rec", String(duration) + "/" + String((int)targetDuration) + "s");
      lastBlink = currentTime;
    }
  } else {
    // 自動語音檢測錄音模式：使用短片段即時處理
    float realtimeChunkTime = min((float)REALTIME_CHUNK_DURATION, maxRecordingTime);
    
    // 檢查是否達到即時處理片段時長
    if (elapsedTime >= realtimeChunkTime * 1000) {
      Serial.printf("⚡ 達到即時處理片段時長(%.1fs)，發送處理\n", realtimeChunkTime);
      stopRecording();
      return;
    }
    
    // 檢查語音活動
    if (!checkVoiceActivity()) {
      // 檢查靜音時長
      if (currentTime - lastSpeechTime > SILENCE_DURATION) {
        // 修復：使用更合理的最短錄音時長判斷（100ms而不是300ms）
        if (elapsedTime > 100 && bufferIndex > 50) { // 至少100ms且有音頻樣本
          Serial.printf("🔇 檢測到靜音，發送即時處理 (時長:%dms, 樣本:%d)\n", elapsedTime, bufferIndex);
          stopRecording();
        } else {
          Serial.printf("🔇 檢測到靜音但錄音過短 (時長:%dms, 樣本:%d)，繼續等待\n", elapsedTime, bufferIndex);
        }
      }
    }
    
    // 更新錄音顯示
    static unsigned long lastBlink = 0;
    if (currentTime - lastBlink > 500) {
      digitalWrite(LED_RECORDING, !digitalRead(LED_RECORDING));
      
      int duration = elapsedTime / 1000;
      int remaining = (int)realtimeChunkTime - duration;
      Serial.printf("🎤 即時錄音中... 時長: %ds, 剩餘: %ds\n", duration, remaining);
      updateLCDDisplay("Live Rec", String(duration) + "/" + String((int)realtimeChunkTime) + "s");
      lastBlink = currentTime;
    }
  }
}

void handleProcessingState() {
  // 閃爍處理LED
  static unsigned long lastBlink = 0;
  if (millis() - lastBlink > 300) {
    digitalWrite(LED_PROCESSING, !digitalRead(LED_PROCESSING));
    lastBlink = millis();
  }
  
  Serial.println("🔄 處理中... 請稍候");
  updateLCDDisplay("Processing", "Please wait...");
}

void handlePlayingState() {
  digitalWrite(LED_SPEAKING, HIGH);
  Serial.println("🔊 播放中... 語音輸出");
  updateLCDDisplay("Playing", "Audio output");
}

void handleDisconnectedState() {
  // 閃爍藍牙圖標
  static unsigned long lastBlink = 0;
  if (millis() - lastBlink > 1000) {
    Serial.println("📱 藍牙未連接，等待配對...");
    updateLCDDisplay("Bluetooth", "Waiting...");
    lastBlink = millis();
  }
}

// === 音頻處理函數 ===

