if-else-master/AI-VoiceTransMic/esp32_voice_mic/esp32_voice_mic.ino
bool checkVoiceActivity() {
  size_t bytesRead;
  esp_err_t result = i2s_read(I2S_NUM_0, audioBuffer, 
                             sizeof(audioBuffer), &bytesRead, 10);
  
  if (result != ESP_OK || bytesRead == 0) {
    return false;
  }
  
  // 計算音頻樣本的RMS值
  long sum = 0;
  int samples = bytesRead / sizeof(int16_t);
  
  for (int i = 0; i < samples; i++) {
    sum += abs(audioBuffer[i]);
  }
  
  int16_t rms = sum / samples;
  
  // 語音活動檢測
  if (rms > SILENCE_THRESHOLD) {
    if (!speechDetected) {
      speechDetected = true;
      Serial.printf("🎤 檢測到語音 (RMS: %d)\n", rms);
    }
    lastSpeechTime = millis();
    
    // 如果正在錄音，將數據添加到緩衝區
    if (recordingActive && bufferIndex < maxBufferSize) {
      size_t samplesToAdd = min((size_t)samples, maxBufferSize - bufferIndex);
      memcpy(&recordingBuffer[bufferIndex], audioBuffer, samplesToAdd * sizeof(int16_t));
      bufferIndex += samplesToAdd;
      
      // 增加調試信息
      if (bufferIndex % 1000 == 0) { // 每1000個樣本顯示一次
        Serial.printf("🎤 錄音進度: %d樣本 (%.1fs)\n", bufferIndex, (float)bufferIndex / SAMPLE_RATE);
      }
    }
    
    return true;
  } else {
    // 即使在靜音時也要收集音頻數據（可能有低音量語音）
    if (recordingActive && bufferIndex < maxBufferSize) {
      size_t samplesToAdd = min((size_t)samples, maxBufferSize - bufferIndex);
      memcpy(&recordingBuffer[bufferIndex], audioBuffer, samplesToAdd * sizeof(int16_t));
      bufferIndex += samplesToAdd;
    }
    
    if (speechDetected && (millis() - lastSpeechTime) > SILENCE_DURATION) {
      speechDetected = false;
      Serial.println("🔇 語音結束");
    }
    return speechDetected;
  }
}

void startRecording() {
  startRecording(false); // 默認為自動語音檢測模式
}

void startRecording(bool manual) {
  if (currentState != IDLE || !bluetoothConnected) {
    return;
  }
  
  manualRecording = manual;
  
  float maxRecordingTime = (float)maxBufferSize / SAMPLE_RATE;
  
  if (manual) {
    float targetDuration = min((float)FIXED_RECORDING_DURATION, maxRecordingTime);
    Serial.printf("🎤 開始手動錄音 (%.1f秒固定時長)...\n", targetDuration);
  } else {
    Serial.printf("🎤 開始自動錄音 (語音檢測, 最大%.1f秒)...\n", maxRecordingTime);
  }
  
  // 重置錄音參數
  bufferIndex = 0;
  recordingStartTime = millis();
  lastSpeechTime = millis();
  recordingActive = true;
  speechDetected = true;
  
  // 更新狀態
  currentState = RECORDING;
  digitalWrite(LED_RECORDING, HIGH);
  
  if (manual) {
    float targetDuration = min((float)FIXED_RECORDING_DURATION, maxRecordingTime);
    Serial.printf("🎤 手動錄音中... 將錄製 %.1f 秒\n", targetDuration);
    updateLCDDisplay("Manual Rec", "Starting...");
  } else {
    Serial.printf("🎤 自動錄音中... 最大 %.1f 秒\n", maxRecordingTime);
    updateLCDDisplay("Auto Rec", "Starting...");
  }
}

void stopRecording() {
  if (currentState != RECORDING) {
    return;
  }
  
  recordingActive = false;
  digitalWrite(LED_RECORDING, LOW);
  
  unsigned long totalDuration = (millis() - recordingStartTime) / 1000;
  
  if (manualRecording) {
    Serial.printf("⏹️ 手動錄音結束，錄製時長: %d秒，共錄製 %d 樣本\n", totalDuration, bufferIndex);
  } else {
    Serial.printf("⏹️ 自動錄音結束，錄製時長: %d秒，共錄製 %d 樣本\n", totalDuration, bufferIndex);
  }
  
  // 重置錄音模式
  manualRecording = false;
  
  // 修復：使用實際錄音時長（毫秒）進行判斷，而不是樣本數
  unsigned long actualDuration = millis() - recordingStartTime;
  
  // 檢查是否有足夠的音頻數據和合理的錄音時長
  bool hasValidAudio = (bufferIndex > 100); // 至少有100個樣本（約6ms的音頻）
  bool hasValidDuration = (actualDuration >= MIN_RECORDING_DURATION); // 至少300ms
  
  Serial.printf("📊 錄音驗證: 樣本數=%d, 實際時長=%dms, 最短時長=%dms\n", 
                bufferIndex, actualDuration, MIN_RECORDING_DURATION);
  
  if (hasValidAudio && (actualDuration >= 100)) { // 降低門檻：至少100ms且有音頻樣本
    // 有效錄音，發送到電腦處理
    Serial.printf("✅ 錄音有效: %d樣本, %dms時長\n", bufferIndex, actualDuration);
    sendAudioToPc();
    currentState = PROCESSING;
    digitalWrite(LED_PROCESSING, HIGH);
    updateLCDDisplay("Processing", "Sending...");
  } else {
    Serial.printf("⚠️ 錄音無效: 樣本=%d (需要>100), 時長=%dms (需要>100ms)\n", 
                  bufferIndex, actualDuration);
    currentState = IDLE;
    updateLCDDisplay("Ready", "Too short");
  }
}

void sendAudioToPc() {
  if (!bluetoothConnected || !pAudioCharacteristic) {
    Serial.println("❌ BLE未連接，無法發送音頻");
    return;
  }
  
  size_t totalBytes = bufferIndex * sizeof(int16_t);
  Serial.printf("📡 準備發送音頻數據: %d 樣本, %d 字節\n", bufferIndex, totalBytes);
  
  // 檢查數據大小是否合理
  if (totalBytes > 500000) { // 大於500KB時發出警告
    Serial.println("⚠️ 音頻數據過大，可能導致傳輸問題");
  }
  
  // 發送音頻頭信息 (格式: 'A' + bufferIndex(4字節) + sampleRate(4字節))
  uint8_t headerData[9]; // 1 + 4 + 4 = 9字節固定格式
  headerData[0] = 'A'; // Audio data identifier
  
  // 強制使用4字節格式發送樣本數和採樣率
  uint32_t samples32 = (uint32_t)bufferIndex;
  uint32_t sampleRate32 = (uint32_t)SAMPLE_RATE;
  
  memcpy(&headerData[1], &samples32, 4);
  memcpy(&headerData[5], &sampleRate32, 4);
  
  // 發送頭部信息
  pAudioCharacteristic->setValue(headerData, sizeof(headerData));
  pAudioCharacteristic->notify();
  Serial.println("📤 音頻頭部信息已發送");
  delay(200); // 增加等待時間確保頭部數據處理完成
  
  // 優化的分塊發送音頻數據
  const size_t chunkSize = 18; // 稍微減小塊大小，留出BLE頭部空間
  size_t totalChunks = (totalBytes + chunkSize - 1) / chunkSize;
  size_t sentChunks = 0;
  
  Serial.printf("📦 開始發送 %d 個數據包...\n", totalChunks);
  
  for (size_t i = 0; i < totalBytes; i += chunkSize) {
    // 檢查連接狀態
    if (!deviceConnected || !bluetoothConnected) {
      Serial.println("❌ BLE連接已斷開，停止發送");
      return;
    }
    
    size_t remainingBytes = min(chunkSize, totalBytes - i);
    uint8_t* dataPtr = (uint8_t*)recordingBuffer + i;
    
    // 設置數據並發送通知
    pAudioCharacteristic->setValue(dataPtr, remainingBytes);
    pAudioCharacteristic->notify();
    
    sentChunks++;
    
    // 每50個包顯示一次進度
    if (sentChunks % 50 == 0) {
      Serial.printf("📊 進度: %d/%d 包 (%.1f%%)\n", 
                   sentChunks, totalChunks, 
                   (float)sentChunks * 100.0 / totalChunks);
    }
    
    // 動態調整延遲時間
    if (sentChunks < 100) {
      delay(30); // 初期較慢
    } else if (sentChunks < 500) {
      delay(25); // 中期適中
    } else {
      delay(20); // 後期較快
    }
  }
  
  Serial.printf("✅ 音頻數據發送完成: %d 包, %d 字節\n", sentChunks, totalBytes);
}

// === 藍牙處理函數 ===

void checkBluetoothConnection() {
  // 檢查BLE連接狀態變化
  if (!deviceConnected && oldDeviceConnected) {
    // 設備斷開連接
    delay(500); // 給BLE堆疊時間準備
    pServer->startAdvertising(); // 重新開始廣播
    Serial.println("📱 重新開始BLE廣播");
    oldDeviceConnected = deviceConnected;
    
    bluetoothConnected = false;
    currentState = BLUETOOTH_DISCONNECTED;
    recordingActive = false;
    digitalWrite(LED_RECORDING, LOW);
    digitalWrite(LED_PROCESSING, LOW);
    digitalWrite(LED_SPEAKING, LOW);
    updateLCDDisplay("Disconnected", "Advertising...");
  }
  
  // 設備連接
  if (deviceConnected && !oldDeviceConnected) {
    oldDeviceConnected = deviceConnected;
    bluetoothConnected = true;
    
    Serial.println("📱 BLE設備已連接");
    Serial.println("📱 系統就緒");
    currentState = IDLE;
    digitalWrite(LED_PROCESSING, LOW);
    digitalWrite(LED_SPEAKING, LOW);
    updateLCDDisplay("Connected", "System Ready");
  }
}

void handleBluetoothData() {
  // BLE通過特徵回調處理，這個函數保留用於兼容性
}

void handleBLECommand(char command) {
  switch (command) {
    case 'P': // Play audio (播放音頻)
      handlePlayAudio();
      break;
      
    case 'S': // Status request (狀態請求)
      sendStatus();
      break;
      
    case 'R': // Ready (處理完成)
      digitalWrite(LED_PROCESSING, LOW);
      currentState = IDLE;
      Serial.println("📱 處理完成，系統就緒");
      break;
      
    case 'E': // Error (錯誤)
      handleError();
      break;
      
    default:
      Serial.printf("⚠️ 未知命令: %c\n", command);
      break;
  }
}

void handlePlayAudio() {
  Serial.println("🔊 接收播放命令，準備播放測試音頻");
  
