if-else-master/AI-VoiceTransMic/esp32_voice_mic/esp32_voice_mic.ino
  currentState = PLAYING;
  digitalWrite(LED_SPEAKING, HIGH);
  updateLCDDisplay("Playing", "Test Audio");
  
  // 播放測試音頻 - 產生一個440Hz的測試音（A音）
  playTestTone(440, 2000); // 440Hz, 2秒
  
  // 播放完成
  digitalWrite(LED_SPEAKING, LOW);
  currentState = IDLE;
  updateLCDDisplay("Ready", getCurrentTime());
  Serial.println("✅ 測試音頻播放完成");
}

void playTestTone(int frequency, int duration_ms) {
  Serial.printf("🎵 播放測試音頻: %dHz, %dms\n", frequency, duration_ms);
  
  // 配置 PWM 輸出 (GPIO26, 使用PWM通道0)
  // 針對不同版本的ESP32 Arduino Core
  #if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
    ledcAttach(SPEAKER_PIN, SAMPLE_RATE * 256, 8);  // 新版本: 引腳, 頻率, 解析度
  #else
    ledcSetup(0, SAMPLE_RATE * 256, 8);  // 舊版本: 通道, 頻率, 解析度
    ledcAttachPin(SPEAKER_PIN, 0);
  #endif
  
  // 計算音頻參數
  int samples_per_cycle = SAMPLE_RATE / frequency;
  int total_samples = (SAMPLE_RATE * duration_ms) / 1000;
  
  Serial.printf("📊 音頻參數: 每週期%d樣本, 總共%d樣本\n", samples_per_cycle, total_samples);
  
  // 產生正弦波並輸出
  for (int i = 0; i < total_samples; i++) {
    // 計算正弦波值 (0-255 for PWM)
    float angle = (2.0 * PI * i) / samples_per_cycle;
    int pwm_value = (int)(127.5 + 120 * sin(angle)); // 128 ± 120
    
    // 確保值在有效範圍內
    pwm_value = constrain(pwm_value, 0, 255);
    
    // 輸出到PWM
    #if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
      ledcWrite(SPEAKER_PIN, pwm_value);  // 新版本: 直接使用引腳
    #else
      ledcWrite(0, pwm_value);            // 舊版本: 使用通道
    #endif
    
    // 控制採樣率
    delayMicroseconds(1000000 / SAMPLE_RATE);
    
    // 檢查是否需要停止播放
    if (currentState != PLAYING) {
      break;
    }
    
    // 每1000個樣本顯示一次進度
    if (i % 1000 == 0) {
      float progress = (float)i * 100.0 / total_samples;
      Serial.printf("🎵 播放進度: %.1f%%\n", progress);
    }
  }
  
  // 關閉PWM輸出
  #if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
    ledcWrite(SPEAKER_PIN, 128); // 新版本: 設為中點，避免爆音
    delay(10);
    ledcDetach(SPEAKER_PIN);
  #else
    ledcWrite(0, 128); // 舊版本: 設為中點，避免爆音
    delay(10);
    ledcDetachPin(SPEAKER_PIN);
  #endif
  Serial.println("🎵 PWM輸出已關閉");
}

void playReceivedAudio(uint8_t* audioData, size_t audioSize) {
  Serial.printf("🎵 播放接收的音頻: %d 字節\n", audioSize);
  
  currentState = PLAYING;
  digitalWrite(LED_SPEAKING, HIGH);
  updateLCDDisplay("Playing", "Received Audio");
  
  // 配置 PWM 輸出 (GPIO26, 使用PWM通道0)
  // 針對不同版本的ESP32 Arduino Core
  #if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
    ledcAttach(SPEAKER_PIN, SAMPLE_RATE * 256, 8);  // 新版本: 引腳, 頻率, 解析度
  #else
    ledcSetup(0, SAMPLE_RATE * 256, 8);  // 舊版本: 通道, 頻率, 解析度
    ledcAttachPin(SPEAKER_PIN, 0);
  #endif
  
  // 將16位音頻轉換為PWM輸出
  int16_t* samples = (int16_t*)audioData;
  size_t sampleCount = audioSize / sizeof(int16_t);
  
  Serial.printf("📊 播放參數: %d 樣本\n", sampleCount);
  
  const int playbackDelay = 1000000 / SAMPLE_RATE; // 微秒
  
  for (size_t i = 0; i < sampleCount; i++) {
    // 16位轉8位 (0-255) 使用更好的轉換算法
    int32_t sample = samples[i];
    
    // 增益調整和削波處理
    sample = sample * 2; // 增加音量
    sample = constrain(sample, -32768, 32767);
    
    // 轉換到0-255範圍 (PWM duty cycle)
    uint8_t pwmValue = (sample + 32768) >> 8;
    pwmValue = constrain(pwmValue, 0, 255);
    
    // 輸出到PWM
    #if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
      ledcWrite(SPEAKER_PIN, pwmValue);  // 新版本: 直接使用引腳
    #else
      ledcWrite(0, pwmValue);            // 舊版本: 使用通道
    #endif
    
    delayMicroseconds(playbackDelay);
    
    // 檢查是否需要停止播放
    if (currentState != PLAYING) {
      break;
    }
    
    // 每2000個樣本顯示一次進度
    if (i % 2000 == 0) {
      float progress = (float)i * 100.0 / sampleCount;
      Serial.printf("🎵 播放進度: %.1f%%\n", progress);
    }
  }
  
  // 關閉PWM輸出
  #if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
    ledcWrite(SPEAKER_PIN, 128); // 新版本: 設為中點，避免爆音
    delay(10);
    ledcDetach(SPEAKER_PIN);
  #else
    ledcWrite(0, 128); // 舊版本: 設為中點，避免爆音
    delay(10);
    ledcDetachPin(SPEAKER_PIN);
  #endif
  digitalWrite(LED_SPEAKING, LOW);
  
  Serial.println("✅ 音頻播放完成");
  currentState = IDLE;
  updateLCDDisplay("Ready", getCurrentTime());
}



void sendStatus() {
  if (!bluetoothConnected || !pCommandCharacteristic) {
    return;
  }
  
  uint8_t statusData[4];
  statusData[0] = 'S'; // Status response
  statusData[1] = (uint8_t)currentState;
  statusData[2] = bluetoothConnected ? 1 : 0;
  statusData[3] = recordingActive ? 1 : 0;
  
  pCommandCharacteristic->setValue(statusData, 4);
  pCommandCharacteristic->notify();
}

void handleError() {
  Serial.println("❌ 收到錯誤信號");
  digitalWrite(LED_PROCESSING, LOW);
  currentState = IDLE;
  Serial.println("📱 處理錯誤，請重試");
}

// === 按鈕處理函數 ===

void checkButtons() {
  static unsigned long lastButtonCheck = 0;
  static bool lastRecordState = HIGH;
  static bool lastModeState = HIGH;
  
  if (millis() - lastButtonCheck < 50) { // 防抖動
    return;
  }
  
  bool recordButton = digitalRead(RECORD_BUTTON);
  bool modeButton = digitalRead(MODE_BUTTON);
  
  // 錄音按鈕 (下降沿觸發)
  if (lastRecordState == HIGH && recordButton == LOW) {
    if (currentState == IDLE) {
      startRecording(true); // 按鈕觸發為手動錄音模式（15秒固定）
    } else if (currentState == RECORDING) {
      Serial.println("🔘 按鈕強制停止錄音");
      stopRecording();
    }
  }
  
  // 模式按鈕 (下降沿觸發)
  if (lastModeState == HIGH && modeButton == LOW) {
    handleModeButton();
  }
  
  lastRecordState = recordButton;
  lastModeState = modeButton;
  lastButtonCheck = millis();
}

void handleModeButton() {
  Serial.println("🔘 模式按鈕按下");
  
  // 根據當前狀態執行不同操作
  switch (currentState) {
    case IDLE:
      // 顯示系統信息
      showSystemInfo();
      break;
      
    case RECORDING:
      // 強制停止錄音
      stopRecording();
      break;
      
    case PROCESSING:
      // 取消處理
      currentState = IDLE;
      digitalWrite(LED_PROCESSING, LOW);
      Serial.println("📱 操作取消，系統就緒");
      break;
      
    case PLAYING:
      // 停止播放
      currentState = IDLE;
      digitalWrite(LED_SPEAKING, LOW);
      Serial.println("📱 播放停止，系統就緒");
      break;
      
    default:
      break;
  }
}

void showSystemInfo() {
  Serial.println("📊 顯示系統信息");
  
  // 循環顯示不同信息
  static int infoIndex = 0;
  
  switch (infoIndex) {
    case 0:
      Serial.println("📱 ESP32-VoiceMic v1.1");
      break;
    case 1:
      Serial.println("📱 Bluetooth: " + String(bluetoothConnected ? "Connected" : "Disconnected"));
      break;
    case 2:
      Serial.println("📱 Memory: " + String(ESP.getFreeHeap()) + " bytes");
      break;
    case 3:
      Serial.println("📱 Uptime: " + String(millis()/1000) + " sec");
      break;
  }
  
  infoIndex = (infoIndex + 1) % 4;
}

// === 輔助函數 ===

void printMemoryInfo(String stage) {
  Serial.printf("📊 %s - 可用內存: %d 字節\n", stage.c_str(), ESP.getFreeHeap());
}

String getCurrentTime() {
  unsigned long uptime = millis() / 1000;
  int hours = uptime / 3600;
  int minutes = (uptime % 3600) / 60;
  int seconds = uptime % 60;
  
  return String(hours) + ":" + 
         (minutes < 10 ? "0" : "") + String(minutes) + ":" +
         (seconds < 10 ? "0" : "") + String(seconds);
}

// === 錯誤處理 ===

void handleSystemError(String error) {
  Serial.println("❌ 系統錯誤: " + error);
  
  // 重置系統狀態
  currentState = IDLE;
  recordingActive = false;
  
  // 關閉所有LED
  digitalWrite(LED_RECORDING, LOW);
  digitalWrite(LED_PROCESSING, LOW);
  digitalWrite(LED_SPEAKING, LOW);
  
  // 顯示錯誤信息
  updateLCDDisplay("Error", error.substring(0, 14));
}

// === LCD顯示函數 ===

void updateLCDDisplay(String line1, String line2) {
  lcd.clear();
  lcd.setCursor(0, 0);
  lcd.print(line1.substring(0, LCD_COLS)); // 限制長度
  
  if (line2.length() > 0) {
    lcd.setCursor(0, 1);
    lcd.print(line2.substring(0, LCD_COLS)); // 限制長度
  }
}
